{"/simply-edit/":{"meta title":"Simply edit the web - by ylebre","meta description":{"content":"Simply-edit demo site!!"},"project-name":"Simply&nbsp;edit the web","project-tagline":"Use the key 'demo' to try out our new editor","link":{"href":"#vedor-edit","class":"btn","innerHTML":"Edit me!"},"main-content":"<h3>\n<a id=\"welcome-to-github-pages\" class=\"anchor\" href=\"#welcome-to-github-pages\" aria-hidden=\"true\"><span class=\"octicon octicon-link\"></span></a>Simply edit&nbsp;GitHub Pages</h3>\n\n<p>This page was automatically generated using GitHub Pages and modified to add support for the Vedor editor. This editor uses the markup provided in the HTML to merge the page with the data, clientside. In this example, the page data is also&nbsp;stored in GitHub.</p>\n\n<h3>Not just Markdown</h3>\n\n<p>While Markdown is fine for most uses, this editor allows you to fully leverage the power of HTML. By using &lt;template&gt; instructions within the HTML, your editor can insert any HTML structure you want. Modifications on the page are quick and simple, leaving you in control.</p>\n\n<h3>Plays well with others</h3>\n\n<p>This editor was designed with an expanding web in mind. The toolbars in the pages are context-aware and are easily added to the editor to add specific options for specific HTML structures. The basic version supports the&nbsp;most&nbsp;commonly used HTML elements (text, images, hyperlinks), but more toolbars are available. Each editor context&nbsp;uses CSS-like selectors to decide which toolbar is best suited.</p>\n\n<h3>CMS&nbsp;Integrations</h3>\n\n<p>We are looking for developers that want to help us integrate the Vedor editor into various platforms. We have integrated the editor in <a href=\"http://www.ariadne-cms.org/\">Ariadne</a>,&nbsp;our own&nbsp;web application platform, but the world of the web is a much larger place. Since the editor is now totally decoupled from Ariadne, we want to share it with as many users as possible.</p>\n\n<h3>\n<a id=\"support-or-contact\" class=\"anchor\" href=\"#support-or-contact\" aria-hidden=\"true\"><span class=\"octicon octicon-link\"></span></a>Support or Contact</h3>\n\n<p>Having trouble with the editor?&nbsp;Have an idea for a 'must have'&nbsp;plugin? Drop me a line here on GitHub. </p>\n\n      <footer class=\"site-footer\">\n        <span class=\"site-footer-owner\"><a href=\"https://github.com/ylebre/simply-edit\">Simply-edit</a> is maintained by <a href=\"https://github.com/ylebre\">ylebre</a>.</span>\n\n        <span class=\"site-footer-credits\">This page was generated by <a href=\"https://pages.github.com\">GitHub Pages</a> using the <a href=\"https://github.com/jasonlong/cayman-theme\">Cayman theme</a> by <a href=\"https://twitter.com/jasonlong\">Jason Long</a>.</span>\n      </footer>"}}